OpenFOAM-7/tutorials/pelletExtruder/tests/PolymKWLF+hPolym+Tait+Cross/PruebaMalla2D/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType          laminar;

laminar
{
    laminarModel generalizedNewtonian;

    viscosityModel CrossPowerLaw;

    nuInf      0; // 0
    n          0.76209; // in the model function the denominator is ^(n) instead of ^(1-n) as defined in many books and programs
    tauStar    34.9386; // (Density= 1050 kg/m^3 at tau=35883.744) Caution: the kinematic viscosity is used for calculation here, i.e. tauStar from Cross-WLF parameters must be divided by the density
}

// ************************************************************************* //
